Digital-bank-aug-02-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Digital-bank-aug-02-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Digital-bank-aug-02-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Digital-bank-aug-02-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1536,681)
      - go(http://localhost:8888/bank/login?logout)
      - clickByID(username)
      - clickByID(password)
      - clickByID(submit)
      - clickByID(checking-menu)
      - clickByID(view-checking-menu-item)
      - clickByID(deposit-menu-item)
      - clickByID(selectedAccount)
      - selectByID(selectedAccount): "Joint Checking (Standard Checking)"
      - clickByID(amount)
      - typeByID(amount): "5.00"
      - clickByCSS(button.btn.btn-primary.btn-sm)
      - clickByCSS(img.user-avatar.rounded-circle)
      - clickByLinkText(Logout)

  Digital-bank-aug-02-Http:
    headers:
      sec-ch-ua: '"Chromium";v="92", " Not A;Brand";v="99", "Google Chrome";v="92"'
      sec-ch-ua-mobile: '?0'
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.107 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/login'
            method: POST
            label: 'http://localhost:8888/bank/login'
            think-time: 0ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
          - url: 'http://localhost:8888/bank/account/checking-view'
            method: GET
            label: 'http://localhost:8888/bank/account/checking-view'
            think-time: 47214ms
            headers: {}
          - url: 'http://localhost:8888/bank/account/deposit'
            method: GET
            label: 'http://localhost:8888/bank/account/deposit'
            think-time: 16377ms
            headers: {}
          - url: 'http://localhost:8888/bank/account/deposit'
            method: POST
            label: 'http://localhost:8888/bank/account/deposit'
            think-time: 11468ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              amount: '5.00'
              id: '131'
          - url: 'http://localhost:8888/bank/logout'
            method: GET
            label: 'http://localhost:8888/bank/logout'
            think-time: 8925ms
            headers: {}