Digital-bank-aug-02-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:

- executor: jmeter
  scenario: Digital-bank-aug-02-Http
  concurrency: 2
  ramp-up: 0s
  hold-for: 20s

scenarios:

  Digital-bank-aug-02-Http:
    headers:
      sec-ch-ua: '"Chromium";v="92", " Not A;Brand";v="99", "Google Chrome";v="92"'
      sec-ch-ua-mobile: '?0'
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.107 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:8888/bank/login'
            method: POST
            label: 'http://localhost:8888/bank/login'
            think-time: 0ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
          - url: 'http://localhost:8888/bank/account/checking-view'
            method: GET
            label: 'http://localhost:8888/bank/account/checking-view'
            think-time: 47214ms
            headers: {}
          - transaction: Make deposit
            force-parent-sample: false
            do:
              - url: 'http://localhost:8888/bank/account/deposit'
                method: GET
                label: 'http://localhost:8888/bank/account/deposit'
                assert:
                  - assume-success: false
                    contains:
                      - "Hubba hubba"
                    not: false
                    regexp: false
                    subject: body
                think-time: 16377ms
                headers: {}
              - url: 'http://localhost:8888/bank/account/deposit'
                method: POST
                label: 'http://localhost:8888/bank/account/deposit'
                think-time: 11468ms
                headers:
                  Content-Type: application/x-www-form-urlencoded
                body:
                  amount: '5.00'
                  id: '131'
          - url: 'http://localhost:8888/bank/logout'
            method: GET
            label: 'http://localhost:8888/bank/logout'
            think-time: 8925ms
            headers: {}